# Taps (adds repositories to search)
tap "buo/cask-upgrade"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "jdxcode/tap/rtx"

#echo sudo pam.d sufficient pamid?
brew "bat"			# Rusty `cat` w/ syntax highlighting + git integration
brew "cmatrix"		# Matrix display
brew "direnv"		# Load/Unload environment variables based on $PWD
brew "exa" 			# Human-reable alternative to `ls`
brew "fzf"			# Command-line fuzzy finder!
brew "gh"			# GitHub CLI
brew "git"			# Everyone needs Git.
brew "git-lfs"		# Git Large File Storage
brew "gnugp"		# GNU Pretty Good Privacy (PGP)
brew "mas"			# Mac App Store (cli app store access)
#brew "neovim"		# Neovim!!!
brew "openjdk@11"	# Java 11
brew "openjdk@17"	# Java 17
brew "openjdk"		# Java 19 (latest)
brew "ripgrep"		# Rusty Grep
brew "jdxcode/tap/rtx"	# One Rusty language manager to rule them all!
brew "stow"			# Symlink Farm Manager
brew "thefuck"		# Typo correction
#brew "tmux"		# Terminal Multiplexer (multiple window panes)
brew "tree"			# Absolutely brilliant tree-view of `ls`
#brew "whalebrew"	# Aliases for Docker Images
brew "zoxide"		# `cd` on steriods. Weighted navigation graph.
brew "zsh"			# MacOS Zsh shell is out of date!
#brew zsh-autosuggestions
#brew zsh-completions
#brew zsh-sytax-highlighting

# Casks (GUI Applications)
#cask_args appdir: "${HOME}/Applications", require_sha: true
cask "android-file-transfer"	# File manager for Android phones
#cask "authy"					# Multi-device 2FA
cask "brave-browser"			# Private Web Browser
cask "docker"					# Lightweight VM Containers
cask "fork"						# Free, Git GUI
cask "jetbrains-toolbox"		# Download & Install JetBrains IDEs
#cask "iina"					# MacOS Native Video Player
cask "obsidian"					# Markdown note-taking app
cask "spotify"					# Music client
cask "slack"					# Work Messaging
#cask "tailscale"				# Construct your own VPN?

# Mac App Store (for automated app store installs)


